<?php
echo '<html><body>';
echo 'Лабораторна робота #0301<br>';
echo 'Завдання 3(4) <br>';
echo 'Задано натуральне число n. Скласти програму,
 яка знаходить суму m перших цифр числа 
n та суму m останніх цифр числа n.  <br>';
$n = "123456444";
$m= 3;
$res1=0; $res2=0;
for ($i = 0; $i < $m; $i++) {
  $res1 += (int)$n[$i];
};
for ($i = strlen($n); $i > (strlen($n) - $m - 1); $i--){
    $res2 += (int)$n[$i];
}
echo "Отримані результати res1 = $res1 <br>";
echo "Отримані результати res2 = $res2 <br>";
echo '</html>';
?>